In [3]:
import pandas as pd

In [4]:
data = [[1, 'Joe', 85000, 1], [2, 'Henry', 80000, 2], [3, 'Sam', 60000, 2], [4, 'Max', 90000, 1], [5, 'Janet', 69000, 1], [6, 'Randy', 85000, 1], [7, 'Will', 70000, 1]]
employee = pd.DataFrame(data, columns=['id', 'name', 'salary', 'departmentId']).astype({'id':'Int64', 'name':'object', 'salary':'Int64', 'departmentId':'Int64'})
data = [[1, 'IT'], [2, 'Sales']]
department = pd.DataFrame(data, columns=['id', 'name']).astype({'id':'Int64', 'name':'object'})

In [5]:
employee

   id   name  salary  departmentId
0   1    Joe   85000             1
1   2  Henry   80000             2
2   3    Sam   60000             2
3   4    Max   90000             1
4   5  Janet   69000             1
5   6  Randy   85000             1
6   7   Will   70000             1

In [6]:
department

   id   name
0   1     IT
1   2  Sales

A company's executives are interested in seeing who earns the most money in each of the company's departments. A high earner in a department is an employee who has a salary in the top three unique salaries for that department.

Write a solution to find the employees who are high earners in each of the departments.

Return the result table in any order.

The result format is in the following example.

| Department | Employee | Salary |
|------------|----------|--------|
| IT         | Max      | 90000  |
| IT         | Joe      | 85000  |
| IT         | Randy    | 85000  |
| IT         | Will     | 70000  |
| Sales      | Henry    | 80000  |
| Sales      | Sam      | 60000  |

In [ ]:
employee["rank"]=employee.groupby(by="departmentId")["salary"].rank(method="dense", ascending=False)
print(employee)
employee.loc[employee["rank"] <= 3].merge(right=department, left_on="departmentId", right_on="id", how="left") \
    .rename(columns={"name_y":"Department", "name_x":"Employee", "salary":"Salary"}) \
    [["Department", "Employee", "Salary"]]

   id   name  salary  departmentId  rank
0   1    Joe   85000             1   2.0
1   2  Henry   80000             2   1.0
2   3    Sam   60000             2   2.0
3   4    Max   90000             1   1.0
4   5  Janet   69000             1   4.0
5   6  Randy   85000             1   2.0
6   7   Will   70000             1   3.0

  Department Employee  Salary
0         IT      Joe   85000
1      Sales    Henry   80000
2      Sales      Sam   60000
3         IT      Max   90000
4         IT    Randy   85000
5         IT     Will   70000